### Import Libraries

In [1]:
import pandas as pd
import numpy as np

### Read CSV file and make a Pandas Dataframe

In [2]:
df = pd.read_csv(r'C:\Users\HP\Desktop\MSDS\THESIS-I\DATASETS\Dataset4_DataCo SMART SUPPLY CHAIN FOR BIG DATA ANALYSIS1\DataCoSupplyChainDataset.csv', encoding= "latin-1")

In [3]:
df.head(5)

,Type,Days for shipping (real),Days for shipment (scheduled),Benefit per order,Sales per customer,Delivery Status,Late_delivery_risk,Category Id,Category Name,Customer City,...,Order Zipcode,Product Card Id,Product Category Id,Product Description,Product Image,Product Name,Product Price,Product Status,shipping date (DateOrders),Shipping Mode
0,DEBIT,3,4,91.250000,314.640015,Advance shipping,0,73,Sporting Goods,Caguas,...,NaN,1360,73,NaN,http://images.acmesports.sports/Smart+watch,Smart watch,327.75,0,2/3/2018 22:56,Standard Class
1,TRANSFER,5,4,-249.089996,311.359985,Late delivery,1,73,Sporting Goods,Caguas,...,NaN,1360,73,NaN,http://images.acmesports.sports/Smart+watch,Smart watch,327.75,0,1/18/2018 12:27,Standard Class
2,CASH,4,4,-247.779999,309.720001,Shipping on time,0,73,Sporting Goods,San Jose,...,NaN,1360,73,NaN,http://images.acmesports.sports/Smart+watch,Smart watch,327.75,0,1/17/2018 12:06,Standard Class
3,DEBIT,3,4,22.860001,304.809998,Advance shipping,0,73,Sporting Goods,Los Angeles,...,NaN,1360,73,NaN,http://images.acmesports.sports/Smart+watch,Smart watch,327.75,0,1/16/2018 11:45,Standard Class
4,PAYMENT,2,4,134.210007,298.250000,Advance shipping,0,73,Sporting Goods,Caguas,...,NaN,1360,73,NaN,http://images.acmesports.sports/Smart+watch,Smart watch,327.75,0,1/15/2018 11:24,Standard Class

### Find Mean, Standard Deviation, Min value, Max value of the entire Dataframe

In [4]:
df.describe()

,Days for shipping (real),Days for shipment (scheduled),Benefit per order,Sales per customer,Late_delivery_risk,Category Id,Customer Id,Customer Zipcode,Department Id,Latitude,...,Order Item Quantity,Sales,Order Item Total,Order Profit Per Order,Order Zipcode,Product Card Id,Product Category Id,Product Description,Product Price,Product Status
count,180519.000000,180519.000000,180519.000000,180519.000000,180519.000000,180519.000000,180519.000000,180516.000000,180519.000000,180519.000000,...,180519.000000,180519.000000,180519.000000,180519.000000,24840.000000,180519.000000,180519.000000,0.0,180519.000000,180519.0
mean,3.497654,2.931847,21.974989,183.107609,0.548291,31.851451,6691.379495,35921.126914,5.443460,29.719955,...,2.127638,203.772096,183.107609,21.974989,55426.132327,692.509764,31.851451,NaN,141.232550,0.0
std,1.623722,1.374449,104.433526,120.043670,0.497664,15.640064,4162.918106,37542.461122,1.629246,9.813646,...,1.453451,132.273077,120.043670,104.433526,31919.279101,336.446807,15.640064,NaN,139.732492,0.0
min,0.000000,0.000000,-4274.979980,7.490000,0.000000,2.000000,1.000000,603.000000,2.000000,-33.937553,...,1.000000,9.990000,7.490000,-4274.979980,1040.000000,19.000000,2.000000,NaN,9.990000,0.0
25%,2.000000,2.000000,7.000000,104.379997,0.000000,18.000000,3258.500000,725.000000,4.000000,18.265432,...,1.000000,119.980003,104.379997,7.000000,23464.000000,403.000000,18.000000,NaN,50.000000,0.0
50%,3.000000,4.000000,31.520000,163.990005,1.000000,29.000000,6457.000000,19380.000000,5.000000,33.144863,...,1.000000,199.919998,163.990005,31.520000,59405.000000,627.000000,29.000000,NaN,59.990002,0.0
75%,5.000000,4.000000,64.800003,247.399994,1.000000,45.000000,9779.000000,78207.000000,7.000000,39.279617,...,3.000000,299.950012,247.399994,64.800003,90008.000000,1004.000000,45.000000,NaN,199.990005,0.0
max,6.000000,4.000000,911.799988,1939.989990,1.000000,76.000000,20757.000000,99205.000000,12.000000,48.781933,...,5.000000,1999.989990,1939.989990,911.799988,99301.000000,1363.000000,76.000000,NaN,1999.989990,0.0

### Find Types and the non null values

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 180519 entries, 0 to 180518
Data columns (total 53 columns):
 #   Column                         Non-Null Count   Dtype
---  ------                         --------------   -----
 0   Type                           180519 non-null  object
 1   Days for shipping (real)       180519 non-null  int64
 2   Days for shipment (scheduled)  180519 non-null  int64
 3   Benefit per order              180519 non-null  float64
 4   Sales per customer             180519 non-null  float64
 5   Delivery Status                180519 non-null  object
 6   Late_delivery_risk             180519 non-null  int64
 7   Category Id                    180519 non-null  int64
 8   Category Name                  180519 non-null  object
 9   Customer City                  180519 non-null  object
 10  Customer Country               180519 non-null  object
 11  Customer Email                 180519 non-null  object
 12  Customer Fname                 180519 non-null  object
 13  Customer Id                    180519 non-null  int64
 14  Customer Lname                 180511 non-null  object
 15  Customer Password              180519 non-null  object
 16  Customer Segment               180519 non-null  object
 17  Customer State                 180519 non-null  object
 18  Customer Street                180519 non-null  object
 19  Customer Zipcode               180516 non-null  float64
 20  Department Id                  180519 non-null  int64
 21  Department Name                180519 non-null  object
 22  Latitude                       180519 non-null  float64
 23  Longitude                      180519 non-null  float64
 24  Market                         180519 non-null  object
 25  Order City                     180519 non-null  object
 26  Order Country                  180519 non-null  object
 27  Order Customer Id              180519 non-null  int64
 28  order date (DateOrders)        180519 non-null  object
 29  Order Id                       180519 non-null  int64
 30  Order Item Cardprod Id         180519 non-null  int64
 31  Order Item Discount            180519 non-null  float64
 32  Order Item Discount Rate       180519 non-null  float64
 33  Order Item Id                  180519 non-null  int64
 34  Order Item Product Price       180519 non-null  float64
 35  Order Item Profit Ratio        180519 non-null  float64
 36  Order Item Quantity            180519 non-null  int64
 37  Sales                          180519 non-null  float64
 38  Order Item Total               180519 non-null  float64
 39  Order Profit Per Order         180519 non-null  float64
 40  Order Region                   180519 non-null  object
 41  Order State                    180519 non-null  object
 42  Order Status                   180519 non-null  object
 43  Order Zipcode                  24840 non-null   float64
 44  Product Card Id                180519 non-null  int64
 45  Product Category Id            180519 non-null  int64
 46  Product Description            0 non-null       float64
 47  Product Image                  180519 non-null  object
 48  Product Name                   180519 non-null  object
 49  Product Price                  180519 non-null  float64
 50  Product Status                 180519 non-null  int64
 51  shipping date (DateOrders)     180519 non-null  object
 52  Shipping Mode                  180519 non-null  object
dtypes: float64(15), int64(14), object(24)
memory usage: 73.0+ MB

### Number of Null values present in each feature

In [6]:
df.isna().sum()

Type                                  0
Days for shipping (real)              0
Days for shipment (scheduled)         0
Benefit per order                     0
Sales per customer                    0
Delivery Status                       0
Late_delivery_risk                    0
Category Id                           0
Category Name                         0
Customer City                         0
Customer Country                      0
Customer Email                        0
Customer Fname                        0
Customer Id                           0
Customer Lname                        8
Customer Password                     0
Customer Segment                      0
Customer State                        0
Customer Street                       0
Customer Zipcode                      3
Department Id                         0
Department Name                       0
Latitude                              0
Longitude                             0
Market                                0
Order City                            0
Order Country                         0
Order Customer Id                     0
order date (DateOrders)               0
Order Id                              0
Order Item Cardprod Id                0
Order Item Discount                   0
Order Item Discount Rate              0
Order Item Id                         0
Order Item Product Price              0
Order Item Profit Ratio               0
Order Item Quantity                   0
Sales                                 0
Order Item Total                      0
Order Profit Per Order                0
Order Region                          0
Order State                           0
Order Status                          0
Order Zipcode                    155679
Product Card Id                       0
Product Category Id                   0
Product Description              180519
Product Image                         0
Product Name                          0
Product Price                         0
Product Status                        0
shipping date (DateOrders)            0
Shipping Mode                         0
dtype: int64

### Feature Extraction for working upon on Dataframe

In [7]:
features=['order date (DateOrders)','Sales','Order Item Discount','Order Item Quantity']

In [8]:
df=df[features]

In [9]:
df.head(5)

  order date (DateOrders)   Sales  Order Item Discount  Order Item Quantity
0         1/31/2018 22:56  327.75            13.110000                    1
1         1/13/2018 12:27  327.75            16.389999                    1
2         1/13/2018 12:06  327.75            18.030001                    1
3         1/13/2018 11:45  327.75            22.940001                    1
4         1/13/2018 11:24  327.75            29.500000                    1

### Applying to Pandas DateTime format for easy access

In [10]:
df['order date (DateOrders)'] =  df['order date (DateOrders)'].apply(pd.to_datetime)

In [11]:
df.head(5)

  order date (DateOrders)   Sales  Order Item Discount  Order Item Quantity
0     2018-01-31 22:56:00  327.75            13.110000                    1
1     2018-01-13 12:27:00  327.75            16.389999                    1
2     2018-01-13 12:06:00  327.75            18.030001                    1
3     2018-01-13 11:45:00  327.75            22.940001                    1
4     2018-01-13 11:24:00  327.75            29.500000                    1

### Sorting the records by date and their time

In [12]:
df = df.sort_values(by='order date (DateOrders)')

In [13]:
df.head(10)

,order date (DateOrders),Sales,Order Item Discount,Order Item Quantity
33833,2015-01-01 00:00:00,299.980011,60.00,1
77011,2015-01-01 00:21:00,199.990005,6.00,1
109322,2015-01-01 00:21:00,250.000000,22.50,5
87884,2015-01-01 00:21:00,129.990005,22.10,1
114915,2015-01-01 01:03:00,199.919998,39.98,4
95938,2015-01-01 01:03:00,150.000000,27.00,3
63764,2015-01-01 01:03:00,49.980000,9.00,2
96131,2015-01-01 01:03:00,299.950012,3.00,5
114914,2015-01-01 01:24:00,99.959999,16.99,2
58046,2015-01-01 01:24:00,299.950012,0.00,5

### Making column of Order date to Index

In [14]:
df.set_axis(df['order date (DateOrders)'], inplace=True)

In [15]:
df.drop(columns=['order date (DateOrders)'],inplace=True)

In [16]:
df.head(10)

                              Sales  Order Item Discount  Order Item Quantity
order date (DateOrders)
2015-01-01 00:00:00      299.980011                60.00                    1
2015-01-01 00:21:00      199.990005                 6.00                    1
2015-01-01 00:21:00      250.000000                22.50                    5
2015-01-01 00:21:00      129.990005                22.10                    1
2015-01-01 01:03:00      199.919998                39.98                    4
2015-01-01 01:03:00      150.000000                27.00                    3
2015-01-01 01:03:00       49.980000                 9.00                    2
2015-01-01 01:03:00      299.950012                 3.00                    5
2015-01-01 01:24:00       99.959999                16.99                    2
2015-01-01 01:24:00      299.950012                 0.00                    5

In [17]:
df.tail()

                              Sales  Order Item Discount  Order Item Quantity
order date (DateOrders)
2018-01-31 22:14:00      215.820007            53.959999                    1
2018-01-31 22:35:00      215.820007            43.160000                    1
2018-01-31 22:56:00      327.750000            13.110000                    1
2018-01-31 23:17:00       11.540000             0.630000                    1
2018-01-31 23:38:00       39.750000             4.770000                    1

### Month-wise Aggregates

In [18]:
monthlysales = df.groupby([(df.index.year), (df.index.month)])['Sales'].sum().astype(int)

In [19]:
monthlydiscount = df.groupby([(df.index.year), (df.index.month)])['Order Item Discount'].sum().astype(int)

In [20]:
monthlyquantity = df.groupby([(df.index.year), (df.index.month)])['Order Item Quantity'].sum().astype(int)

### Monthly Sales

In [22]:
print('Monthly Sales across the Years:')
print(monthlysales)

Monthly Sales across the Years:
order date (DateOrders)  order date (DateOrders)
2015                     1                          1051590
                         2                           927009
                         3                          1051253
                         4                          1014463
                         5                          1050478
                         6                          1024006
                         7                          1038081
                         8                          1029494
                         9                          1018338
                         10                         1049154
                         11                         1029120
                         12                         1057840
2016                     1                          1046308
                         2                           968542
                         3                          1025853
                         4                          1001211
                         5                          1029400
                         6                          1003059
                         7                          1045715
                         8                          1048200
                         9                          1002397
                         10                         1048130
                         11                         1047590
                         12                         1037408
2017                     1                          1029698
                         2                           992534
                         3                          1048004
                         4                          1038321
                         5                          1105485
                         6                          1032086
                         7                          1104373
                         8                          1109337
                         9                          1143775
                         10                         1073994
                         11                          626914
                         12                          503910
2018                     1                           331650
Name: Sales, dtype: int32

### Monthly Discount

In [23]:
print('Monthly Discount across the Years:')
print(monthlydiscount)

Monthly Discount across the Years:
order date (DateOrders)  order date (DateOrders)
2015                     1                          106209
                         2                           93998
                         3                          107204
                         4                          102460
                         5                          106539
                         6                          103765
                         7                          105145
                         8                          104303
                         9                          103817
                         10                         106024
                         11                         104518
                         12                         107315
2016                     1                          106025
                         2                           98427
                         3                          104366
                         4                          100719
                         5                          104423
                         6                          101612
                         7                          106500
                         8                          105792
                         9                          102026
                         10                         106249
                         11                         106394
                         12                         105296
2017                     1                          104226
                         2                          100611
                         3                          105715
                         4                          106004
                         5                          112287
                         6                          104641
                         7                          111951
                         8                          112830
                         9                          116664
                         10                         107913
                         11                          63521
                         12                          51170
2018                     1                           33699
Name: Order Item Discount, dtype: int32

### Monthly Quantity

In [25]:
print('Monthly Quantity across the Years:')
print(monthlyquantity)

Monthly Quantity across the Years:
order date (DateOrders)  order date (DateOrders)
2015                     1                          11854
                         2                          10438
                         3                          12062
                         4                          11287
                         5                          11902
                         6                          11203
                         7                          11800
                         8                          11612
                         9                          11366
                         10                         11703
                         11                         11463
                         12                         11790
2016                     1                          11597
                         2                          10765
                         3                          11349
                         4                          11208
                         5                          11603
                         6                          11008
                         7                          11652
                         8                          11683
                         9                          11284
                         10                         11936
                         11                         11493
                         12                         11774
2017                     1                          11605
                         2                          11070
                         3                          11676
                         4                          11189
                         5                          11033
                         6                          10194
                         7                          11091
                         8                          11095
                         9                          10502
                         10                          2490
                         11                          2055
                         12                          2124
2018                     1                           2123
Name: Order Item Quantity, dtype: int32

### Display in single Dataframe

In [26]:
totalsales=pd.DataFrame(monthlysales)
totaldiscount=pd.DataFrame(monthlydiscount)
totalquantitiy=pd.DataFrame(monthlyquantity)

In [27]:
total=totalsales.join(totaldiscount)

In [28]:
total=total.join(totalquantitiy)

In [29]:
total.head()

                                                   Sales  Order Item Discount  \
order date (DateOrders) order date (DateOrders)
2015                    1                        1051590               106209
                        2                         927009                93998
                        3                        1051253               107204
                        4                        1014463               102460
                        5                        1050478               106539

                                                 Order Item Quantity
order date (DateOrders) order date (DateOrders)
2015                    1                                      11854
                        2                                      10438
                        3                                      12062
                        4                                      11287
                        5                                      11902

In [30]:
y = total.index.get_level_values(0)
m = total.index.get_level_values(1)

In [31]:
total['Date'] = pd.to_datetime(y* 10000 + m * 100 + 1, format="%Y%m%d")

In [32]:
total.set_index('Date', append=True, inplace=True)

In [33]:
total=total.droplevel(0)

In [34]:
total=total.droplevel(0)

In [36]:
total.head(10)

              Sales  Order Item Discount  Order Item Quantity
Date
2015-01-01  1051590               106209                11854
2015-02-01   927009                93998                10438
2015-03-01  1051253               107204                12062
2015-04-01  1014463               102460                11287
2015-05-01  1050478               106539                11902
2015-06-01  1024006               103765                11203
2015-07-01  1038081               105145                11800
2015-08-01  1029494               104303                11612
2015-09-01  1018338               103817                11366
2015-10-01  1049154               106024                11703